InformationRegisters/ПрочтенныеСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ПрочтенныеСообщения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СообщенияДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>СообщенияДокументы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/СообщенияСервер/Ext/Module.bsl
Процедура ОтметитьСообщенияПрочтенными(пСсылка, пПользователь = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(пСсылка) Тогда 
		Возврат;
	КонецЕсли;
	яПользователь = ?(пПользователь = Неопределено, ПараметрыСеанса.ТекущийПользователь, пПользователь);
	
	яМЗ = РегистрыСведений.ПрочтенныеСообщения.СоздатьМенеджерЗаписи();
	яМЗ.Документ		= пСсылка;
	яМЗ.Пользователь	= яПользователь;
	яМЗ.Прочитать();
	яМЗ.Документ		= пСсылка;
	яМЗ.Пользователь	= яПользователь;
	яМЗ.Дата			= ТекущаяДата();
	яМЗ.Записать(Истина);
КонецПроцедуры


Функция ПолучитьКоличествоНепрочтенныхСообщений(пСсылка, пПользователь = Неопределено) Экспорт
	Если Не ЗначениеЗаполнено(пСсылка) Тогда 
		Возврат 0;
	КонецЕсли;
	яПользователь = ?(пПользователь = Неопределено, ПараметрыСеанса.ТекущийПользователь, пПользователь);
	
	яЗапрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрочтенныеСообщения.Документ,
	|	ПрочтенныеСообщения.Пользователь,
	|	ПрочтенныеСообщения.Дата
	|ПОМЕСТИТЬ втНепрочтенные
	|ИЗ
	|	РегистрСведений.ПрочтенныеСообщения КАК ПрочтенныеСообщения
	|ГДЕ
	|	ПрочтенныеСообщения.Документ = &Документ
	|	И ПрочтенныеСообщения.Пользователь = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СообщенияДокументы.Документ,
	|	СообщенияДокументы.Автор,
	|	СообщенияДокументы.Дата
	|ПОМЕСТИТЬ втСоощения
	|ИЗ
	|	РегистрСведений.СообщенияДокументы КАК СообщенияДокументы
	|ГДЕ
	|	СообщенияДокументы.Документ = &Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КОЛИЧЕСТВО(втСоощения.Дата) КАК КоличествоНепрочтенных
	|ИЗ
	|	втНепрочтенные КАК втНепрочтенные
	|		ЛЕВОЕ СОЕДИНЕНИЕ втСоощения КАК втСоощения
	|		ПО (ЕСТЬNULL(втНепрочтенные.Дата, &ДатаНач) < втСоощения.Дата)");
	яЗапрос.УстановитьПараметр("Документ",		пСсылка);
	яЗапрос.УстановитьПараметр("ДатаНач",		Дата("00010101000000"));
	яЗапрос.УстановитьПараметр("Пользователь",	яПользователь);
	яРезультатЗапроса = яЗапрос.Выполнить();
	яВ = яРезультатЗапроса.Выбрать();
	Если яВ.Следующий() Тогда
		Возврат ?(яВ.КоличествоНепрочтенных = NULL, 0, яВ.КоличествоНепрочтенных); 
	КонецЕсли;
	
	Возврат 0;
КонецФункции
